---
title: DocumentSaveToCentralProgressChangedEventArgs
classe: Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# DocumentSaveToCentralProgressChangedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean FailureDueToConflicts { get; }` | `documentSaveToCentralProgressChangedEventArgs.FailureDueToConflicts` | Boolean |
| `Int32 RetryTimes { get; }` | `documentSaveToCentralProgressChangedEventArgs.RetryTimes` | Int32 |
| `Boolean SaveToCentralFinished { get; }` | `documentSaveToCentralProgressChangedEventArgs.SaveToCentralFinished` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```